/*****************************************************************************
 * プログラム名 : sample0414.c
 * 作成 : 2019/09/02 小山
 * 内容 : for文の二重ループ(*で長方形を表示する)
 ****************************************************************************/

#include <stdio.h>

void main() {
	int x, y;
	printf("=== *で長方形を表示 ===\n");
	printf("行数を指定してください : ");
	scanf("%d", &y);
	printf("列数を指定してください : ");
	scanf("%d", &x); 
	
	for (int i = 1; i <= x; i++) {
		for (int j = 1; j <= y; j++) {
			printf("*");
		}
		printf("\n");
	}

}